## Data Types in Python

#### Float & Integer

In [2]:
a = 13.14
b = 4896
print("a =",a,"is",type(a))
print("b =",b,"is",type(b))

a = 13.14 is <class 'float'>
b = 4896 is <class 'int'>

#### String

In [3]:
sentence_str = "Handsome Koh is a really handsome guy."
sentence_lst = sentence_str.split()
print(sentence_str)
print(sentence_lst)

Handsome Koh is a really handsome guy.
['Handsome', 'Koh', 'is', 'a', 'really', 'handsome', 'guy.']

#### Boolean

In [4]:
num1 = 4896
num2 = 0
num3 = -1

print(bool(num1),bool(num2),bool(num3))

True False True

## Data Structures in Python

In [6]:
weekdays_tup = ('Sunday','Monday','Tuesday','Wednesday','Thursday','Friday','Saturday')
weekdays_tup

('Sunday', 'Monday', 'Tuesday', 'Wednesday', 'Thursday', 'Friday', 'Saturday')

In [9]:
weekdays_lst = list(weekdays_tup)
weekdays_lst

['Sunday', 'Monday', 'Tuesday', 'Wednesday', 'Thursday', 'Friday', 'Saturday']

In [11]:
str1 = "Handsome"
str2 = 'Koh'
str3 = 13.14
str4 = 4896
str5 = True

record_lst = list()
record_lst.append(str1)
record_lst.append(str2)
record_lst.append(str3)
record_lst.append(str4)
record_lst.append(str5)
record_lst

['Handsome', 'Koh', 13.14, 4896, True]

In [12]:
record_dict = dict()
record_dict['first'] = str1
record_dict['last'] = str2
record_dict['rating'] = str3
record_dict['salary'] = str4
record_dict['executive'] = str5
record_dict

{'first': 'Handsome',
 'last': 'Koh',
 'rating': 13.14,
 'salary': 4896,
 'executive': True}

## NumPy

NumPy random number generator

In [13]:
import numpy as np

In [17]:
np.random.seed(10)

In [18]:
rand_arr = np.random.random((2,2)) 	# array with random values
print(np.round(rand_arr,3))

[[0.771 0.021]
 [0.634 0.749]]

## Dealing with File

#### Import plain text file

open file in Python has 3 modes:
1. r - read only
2. w - write / overwrite
3. a - append / write at the bottom

In [19]:
sentence_file = open('Sentence.txt','r')
sentence_file

In [20]:
sentence_str = sentence_file.read()
sentence_str

'All models are wrong, but some are useful'

In [21]:
sentence_lst = sentence_str.split()
sentence_lst

['All', 'models', 'are', 'wrong,', 'but', 'some', 'are', 'useful']

### Import/Export CSV Files in Python

In [22]:
import pandas as pd

In [24]:
titanic_df = pd.read_csv('titanic.csv')
titanic_df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,Unnamed: 15
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,NaN
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,NaN
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,NaN
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,NaN
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,NaN
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,NaN
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,NaN
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,NaN
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,NaN